////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ ФОРМЫ: Выгрузка-Загрузка УП -> БП
// v1.00
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)

    Ответ = Вопрос("Выгрузить данные из текущей базы УП в XML-файл?",
                   РежимДиалогаВопрос.ДаНет, ,
                   КодВозвратаДиалога.Нет);
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

    Обработки.ВыгрузкаЗагрузкаУПБП.Создать().ВыгрузитьДанныеУП();

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)

    Ответ = Вопрос("Загрузить данные из XML-файла в текущую базу БП?",
                   РежимДиалогаВопрос.ДаНет, ,
                   КодВозвратаДиалога.Нет);
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

    Обработки.ВыгрузкаЗагрузкаУПБП.Создать().ЗагрузитьДанныеВБП();

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    Диалог.Фильтр = "XML файлы (*.xml)|*.xml|Все файлы (*.*)|*.*";
    Диалог.Заголовок = "Укажите файл для выгрузки данных из УП";

    Если Диалог.Выбрать() Тогда
        ЭтаФорма.ИмяФайлаВыгрузки = Диалог.ПолноеИмяФайла;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Фильтр = "XML файлы (*.xml)|*.xml|Все файлы (*.*)|*.*";
    Диалог.Заголовок = "Укажите XML-файл с данными из УП";

    Если Диалог.Выбрать() Тогда
        ЭтаФорма.ИмяФайлаЗагрузки = Диалог.ПолноеИмяФайла;
    КонецЕсли;

КонецПроцедуры
