////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ ОБЪЕКТА: Выгрузка-Загрузка УП -> БП
// v1.00
////////////////////////////////////////////////////////////////////////////////

Перем ВерсияОбработки Экспорт;

Процедура ВыгрузитьДанныеУП() Экспорт

    Сообщить("===========================================");
    Сообщить("ВЫГРУЗКА ДАННЫХ ИЗ УП (v" + ВерсияОбработки + ")");
    Сообщить("===========================================");

КонецПроцедуры

Процедура ЗагрузитьДанныеВБП() Экспорт

    Сообщить("===========================================");
    Сообщить("ЗАГРУЗКА ДАННЫХ В БП (v" + ВерсияОбработки + ")");
    Сообщить("===========================================");

КонецПроцедуры
